# Imorting pandas

In [1]:
import pandas as pd
import numpy as np

# Pandas Series

# Creating pandas series

In [4]:
my_series1 = pd.Series([10,20,30,"cat","Dog"],index=["a","b","c","d","e"])

In [5]:
my_series1["a"]

10

In [7]:
my_series1[0]

10

In [12]:
my_series2 = pd.Series({"p":100,"q":200,"r":300})
my_series2

p    100
q    200
r    300
dtype: int64

# Pandas Data Frames

# Creating pandas data frames

# (01) Using dictionaries

In [14]:
d={"Name":["Sam","Kane","Jane"],"Age":[23,21,24]}
d

{'Name': ['Sam', 'Kane', 'Jane'], 'Age': [23, 21, 24]}

In [21]:
df1=pd.DataFrame(d)
df1

   Name  Age
0   Sam   23
1  Kane   21
2  Jane   24

# (02) Creating data frames using CSV files

In [19]:
df = pd.read_csv("E:\\ML training\\18\\iris.csv")
df

       Id  Sepal.Length  Sepal.Width  Petal.Length  Petal.Width    Species
0    1001           5.1          3.5           1.4          0.2     setosa
1    1002           4.9          3.0           1.4          0.2     setosa
2    1003           4.7          3.2           1.3          0.2     setosa
3    1004           4.6          3.1           1.5          0.2     setosa
4    1005           5.0          3.6           1.4          0.2     setosa
..    ...           ...          ...           ...          ...        ...
145  1146           6.7          3.0           5.2          2.3  virginica
146  1147           6.3          2.5           5.0          1.9  virginica
147  1148           6.5          3.0           5.2          2.0  virginica
148  1149           6.2          3.4           5.4          2.3  virginica
149  1150           5.9          3.0           5.1          1.8  virginica

[150 rows x 6 columns]

In [22]:
type(df)

pandas.core.frame.DataFrame

In [23]:
type(df1)

pandas.core.frame.DataFrame

# Top values of the data set

In [24]:
df.head()

     Id  Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
0  1001           5.1          3.5           1.4          0.2  setosa
1  1002           4.9          3.0           1.4          0.2  setosa
2  1003           4.7          3.2           1.3          0.2  setosa
3  1004           4.6          3.1           1.5          0.2  setosa
4  1005           5.0          3.6           1.4          0.2  setosa

In [25]:
df.head(10)

     Id  Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
0  1001           5.1          3.5           1.4          0.2  setosa
1  1002           4.9          3.0           1.4          0.2  setosa
2  1003           4.7          3.2           1.3          0.2  setosa
3  1004           4.6          3.1           1.5          0.2  setosa
4  1005           5.0          3.6           1.4          0.2  setosa
5  1006           5.4          3.9           1.7          0.4  setosa
6  1007           4.6          3.4           1.4          0.3  setosa
7  1008           5.0          3.4           1.5          0.2  setosa
8  1009           4.4          2.9           1.4          0.2  setosa
9  1010           4.9          3.1           1.5          0.1  setosa

# Bottom values of the data set

In [26]:
df.tail()

       Id  Sepal.Length  Sepal.Width  Petal.Length  Petal.Width    Species
145  1146           6.7          3.0           5.2          2.3  virginica
146  1147           6.3          2.5           5.0          1.9  virginica
147  1148           6.5          3.0           5.2          2.0  virginica
148  1149           6.2          3.4           5.4          2.3  virginica
149  1150           5.9          3.0           5.1          1.8  virginica

In [27]:
df.tail(8)

       Id  Sepal.Length  Sepal.Width  Petal.Length  Petal.Width    Species
142  1143           5.8          2.7           5.1          1.9  virginica
143  1144           6.8          3.2           5.9          2.3  virginica
144  1145           6.7          3.3           5.7          2.5  virginica
145  1146           6.7          3.0           5.2          2.3  virginica
146  1147           6.3          2.5           5.0          1.9  virginica
147  1148           6.5          3.0           5.2          2.0  virginica
148  1149           6.2          3.4           5.4          2.3  virginica
149  1150           5.9          3.0           5.1          1.8  virginica

# Columns & indexes of the data set

In [29]:
df.columns

Index(['Id', 'Sepal.Length', 'Sepal.Width', 'Petal.Length', 'Petal.Width',
       'Species'],
      dtype='object')

In [30]:
df.index

RangeIndex(start=0, stop=150, step=1)

In [32]:
print(list(df.index))

[0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84, 85, 86, 87, 88, 89, 90, 91, 92, 93, 94, 95, 96, 97, 98, 99, 100, 101, 102, 103, 104, 105, 106, 107, 108, 109, 110, 111, 112, 113, 114, 115, 116, 117, 118, 119, 120, 121, 122, 123, 124, 125, 126, 127, 128, 129, 130, 131, 132, 133, 134, 135, 136, 137, 138, 139, 140, 141, 142, 143, 144, 145, 146, 147, 148, 149]

# Shape of the data frame

In [33]:
df.shape #dimensions

(150, 6)

In [34]:
len(df) #number of rows

150

# (03) Creating data frames using Excel files

In [38]:
df2=pd.read_excel("E:\\ML training\\18\\iris.xlsx") 
df2

     Sepal.Length  Sepal.Width  Petal.Length  Petal.Width    Species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

In [39]:
df2.head()

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [42]:
df2=pd.read_excel("E:\\ML training\\18\\iris.xlsx",sheet_name="marks")
df2

   ID  Marks
0   1     67
1   2     78
2   3     76
3   4     66
4   5     89

In [44]:
df2=pd.read_excel("E:\\ML training\\18\\iris.xlsx",sheet_name="iris")
df2

     Sepal.Length  Sepal.Width  Petal.Length  Petal.Width    Species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

In [45]:
ef = pd.ExcelFile("E:\\ML training\\18\\iris.xlsx")
ef

In [46]:
ef.sheet_names

['iris', 'marks']

In [47]:
ef.parse("iris")

     Sepal.Length  Sepal.Width  Petal.Length  Petal.Width    Species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

In [49]:
ef.parse("marks")

   ID  Marks
0   1     67
1   2     78
2   3     76
3   4     66
4   5     89

In [51]:
df4 = ef.parse("marks")
df5 = ef.parse("iris")

In [52]:
df4.head()

   ID  Marks
0   1     67
1   2     78
2   3     76
3   4     66
4   5     89

# Adding new columns

In [53]:
df=pd.DataFrame({"Col1":[12,22,23,34,45],"Col2":[45,43,44,46,54],"Col3":[56,43,46,67,65]})
df

   Col1  Col2  Col3
0    12    45    56
1    22    43    43
2    23    44    46
3    34    46    67
4    45    54    65

In [54]:
df["col4"] = [10,20,30,40,50]

In [55]:
df

   Col1  Col2  Col3  col4
0    12    45    56    10
1    22    43    43    20
2    23    44    46    30
3    34    46    67    40
4    45    54    65    50

# Accessing columns & elements

In [ ]:
df=pd.DataFrame({"Col1":[12,22,23,34,45],"Col2":[45,43,44,46,54],"Col3":[56,43,46,67,65]})
df

# Accessing columns

In [56]:
df.columns

Index(['Col1', 'Col2', 'Col3', 'col4'], dtype='object')

In [58]:
df["Col1"]

0    12
1    22
2    23
3    34
4    45
Name: Col1, dtype: int64

In [60]:
df[["Col2","Col3"]]

   Col2  Col3
0    45    56
1    43    43
2    44    46
3    46    67
4    54    65

In [61]:
type(df["Col1"])

pandas.core.series.Series

# Accessing elements

# Basic column operations

In [ ]:
data = np.arange(10).reshape(5,2)
df = pd.DataFrame(data,columns=["Col1","Col2"])
df

# Pandas data frames with apply function

In [ ]:
data = np.arange(10).reshape(5,2)
df = pd.DataFrame(data,columns=["Col1","Col2"])
df

# Selecting rows that have certain values

# Boolean masking technique

In [ ]:
df=pd.DataFrame({"Name":["A","B","C","D","E","F"],"Age":[23,33,21,35,23,34],"Result":["Pass","Fail","Pass","Pass","Fail","Fail"]})
df

# Data summaries

In [ ]:
data=np.random.random(10).reshape(5,2)
data

In [ ]:
df=pd.DataFrame(data,columns=["A","B"],index=["a","b","c","d","e"])
df

# Summaries for each column

# Summaries for each row

# Finding sums for columns and rows separately

# Finding cumulative sums for columns and rows separately

# Finding means for columns and rows separately

# Finding minumum and maximum for columns and rows separately

# Dropping rows & columns

In [ ]:
df=pd.DataFrame({"Name":["A","B","C"],"Age":[23,33,21],"Result":["Pass","Fail","Pass"]},index=["a","b","c"])
df

# Dropping rows

# Dropping columns

In [ ]:
df=pd.DataFrame({"Name":["A","B","C"],"Age":[23,33,21],"Result":["Pass","Fail","Pass"]},index=["a","b","c"])
df

# Sorting data frames with column values

In [ ]:
d={"Name":["Sam","Jane","Kane"],"Mark1":[67,54,44],"Mark2":[56,56,67],"Mark3":[78,89,76]}
df=pd.DataFrame(d)
df

# Grouping data frames with categorical data

In [ ]:
d={"ID":[1001,1002,1003,1004,1005],"Age":[23,33,34,24,25],"Gender":["F","F","M","F","M"],"Marks":[67,69,76,74,90]}
df=pd.DataFrame(d)
df

# Summaries for other variables with grouping

# Concatenating data frames

In [ ]:
df1=pd.DataFrame(np.random.random((5,2)),columns=["A","B"])
df2=pd.DataFrame(np.random.random((5,2)),columns=["A","B"])

In [ ]:
df1

In [ ]:
df2

# Concatenating along the rows

# Concatenating along the columns

# Merging data frames

In [ ]:
df1=pd.DataFrame({"ID":[1,2,3,4],"Val1":[23,33,34,45]})
df2=pd.DataFrame({"ID":[3,4,5,6],"Val2":[56,32,67,65]})

In [ ]:
df1

In [ ]:
df2

# Focus on the common Ids

# Focus on the all Ids

# Focus on the left side data frame Ids

# Focus on the right side data frame Ids

# Counting values

In [ ]:
d={"Col1":["P","P","Q"],"Col2":["X","Y","Z"],"Col3":["A","B","C"]}
df=pd.DataFrame(d)
df

# Unique values in a column

In [ ]:
d={"Col1":["P","P","Q"],"Col2":["X","Y","Z"],"Col3":["A","B","C"]}
df=pd.DataFrame(d)
df

# Working with indexes & columns

In [ ]:
d={"Name":["Sam","Pam","Jane"],"Marks":[56,32,78],"Class":[1,2,3]}
df=pd.DataFrame(d,index=["a","b","c"])
df

# Columns of the data frame

# Indexes of the data frame

# Changing the order of the rows

# Changing the order of the columns

# Renaming the indexes & columns

# Making indexes as a column